{"class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 3, 224, 224], "input_dtype": "float32", "sparse": false, "name": "input_1"}, "inbound_nodes": []}, {"name": "convolution2d_1", "class_name": "Convolution2D", "config": {"activity_regularizer": null, "name": "convolution2d_1", "bias": true, "trainable": true, "nb_col": 3, "subsample": [1, 1], "nb_row": 3, "b_regularizer": null, "dim_ordering": "th", "b_constraint": null, "nb_filter": 64, "init": "glorot_uniform", "W_regularizer": null, "border_mode": "same", "W_constraint": null, "activation": "relu"}, "inbound_nodes": [[["input_1", 0, 0]]]}, {"name": "convolution2d_2", "class_name": "Convolution2D", "config": {"activity_regularizer": null, "name": "convolution2d_2", "bias": true, "trainable": true, "nb_col": 3, "subsample": [1, 1], "nb_row": 3, "b_regularizer": null, "dim_ordering": "th", "b_constraint": null, "nb_filter": 64, "init": "glorot_uniform", "W_regularizer": null, "border_mode": "same", "W_constraint": null, "activation": "relu"}, "inbound_nodes": [[["convolution2d_1", 0, 0]]]}, {"name": "maxpooling2d_1", "class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_1", "strides": [2, 2], "trainable": true, "border_mode": "valid", "pool_size": [2, 2], "dim_ordering": "th"}, "inbound_nodes": [[["convolution2d_2", 0, 0]]]}, {"name": "convolution2d_3", "class_name": "Convolution2D", "config": {"activity_regularizer": null, "name": "convolution2d_3", "bias": true, "trainable": true, "nb_col": 3, "subsample": [1, 1], "nb_row": 3, "b_regularizer": null, "dim_ordering": "th", "b_constraint": null, "nb_filter": 128, "init": "glorot_uniform", "W_regularizer": null, "border_mode": "same", "W_constraint": null, "activation": "relu"}, "inbound_nodes": [[["maxpooling2d_1", 0, 0]]]}, {"name": "convolution2d_4", "class_name": "Convolution2D", "config": {"activity_regularizer": null, "name": "convolution2d_4", "bias": true, "trainable": true, "nb_col": 3, "subsample": [1, 1], "nb_row": 3, "b_regularizer": null, "dim_ordering": "th", "b_constraint": null, "nb_filter": 128, "init": "glorot_uniform", "W_regularizer": null, "border_mode": "same", "W_constraint": null, "activation": "relu"}, "inbound_nodes": [[["convolution2d_3", 0, 0]]]}, {"name": "maxpooling2d_2", "class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_2", "strides": [2, 2], "trainable": true, "border_mode": "valid", "pool_size": [2, 2], "dim_ordering": "th"}, "inbound_nodes": [[["convolution2d_4", 0, 0]]]}, {"name": "convolution2d_5", "class_name": "Convolution2D", "config": {"activity_regularizer": null, "name": "convolution2d_5", "bias": true, "trainable": true, "nb_col": 3, "subsample": [1, 1], "nb_row": 3, "b_regularizer": null, "dim_ordering": "th", "b_constraint": null, "nb_filter": 256, "init": "glorot_uniform", "W_regularizer": null, "border_mode": "same", "W_constraint": null, "activation": "relu"}, "inbound_nodes": [[["maxpooling2d_2", 0, 0]]]}, {"name": "convolution2d_6", "class_name": "Convolution2D", "config": {"activity_regularizer": null, "name": "convolution2d_6", "bias": true, "trainable": true, "nb_col": 3, "subsample": [1, 1], "nb_row": 3, "b_regularizer": null, "dim_ordering": "th", "b_constraint": null, "nb_filter": 256, "init": "glorot_uniform", "W_regularizer": null, "border_mode": "same", "W_constraint": null, "activation": "relu"}, "inbound_nodes": [[["convolution2d_5", 0, 0]]]}, {"name": "maxpooling2d_3", "class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_3", "strides": [2, 2], "trainable": true, "border_mode": "valid", "pool_size": [2, 2], "dim_ordering": "th"}, "inbound_nodes": [[["convolution2d_6", 0, 0]]]}, {"name": "convolution2d_8", "class_name": "Convolution2D", "config": {"activity_regularizer": null, "name": "convolution2d_8", "bias": true, "trainable": true, "nb_col": 3, "subsample": [1, 1], "nb_row": 3, "b_regularizer": null, "dim_ordering": "th", "b_constraint": null, "nb_filter": 512, "init": "glorot_uniform", "W_regularizer": null, "border_mode": "same", "W_constraint": null, "activation": "relu"}, "inbound_nodes": [[["maxpooling2d_3", 0, 0]]]}, {"name": "convolution2d_9", "class_name": "Convolution2D", "config": {"activity_regularizer": null, "name": "convolution2d_9", "bias": true, "trainable": true, "nb_col": 3, "subsample": [1, 1], "nb_row": 3, "b_regularizer": null, "dim_ordering": "th", "b_constraint": null, "nb_filter": 512, "init": "glorot_uniform", "W_regularizer": null, "border_mode": "same", "W_constraint": null, "activation": "relu"}, "inbound_nodes": [[["convolution2d_8", 0, 0]]]}, {"name": "maxpooling2d_4", "class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_4", "strides": [2, 2], "trainable": true, "border_mode": "valid", "pool_size": [2, 2], "dim_ordering": "th"}, "inbound_nodes": [[["convolution2d_9", 0, 0]]]}, {"name": "convolution2d_11", "class_name": "Convolution2D", "config": {"activity_regularizer": null, "name": "convolution2d_11", "bias": true, "trainable": true, "nb_col": 3, "subsample": [1, 1], "nb_row": 3, "b_regularizer": null, "dim_ordering": "th", "b_constraint": null, "nb_filter": 512, "init": "glorot_uniform", "W_regularizer": null, "border_mode": "same", "W_constraint": null, "activation": "relu"}, "inbound_nodes": [[["maxpooling2d_4", 0, 0]]]}, {"name": "convolution2d_12", "class_name": "Convolution2D", "config": {"activity_regularizer": null, "name": "convolution2d_12", "bias": true, "trainable": true, "nb_col": 3, "subsample": [1, 1], "nb_row": 3, "b_regularizer": null, "dim_ordering": "th", "b_constraint": null, "nb_filter": 512, "init": "glorot_uniform", "W_regularizer": null, "border_mode": "same", "W_constraint": null, "activation": "relu"}, "inbound_nodes": [[["convolution2d_11", 0, 0]]]}, {"name": "maxpooling2d_5", "class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_5", "strides": [2, 2], "trainable": true, "border_mode": "valid", "pool_size": [2, 2], "dim_ordering": "th"}, "inbound_nodes": [[["convolution2d_12", 0, 0]]]}, {"name": "convolution2d_10", "class_name": "Convolution2D", "config": {"activity_regularizer": null, "name": "convolution2d_10", "bias": true, "trainable": true, "nb_col": 1, "subsample": [1, 1], "nb_row": 1, "b_regularizer": null, "dim_ordering": "th", "b_constraint": null, "nb_filter": 21, "init": "glorot_uniform", "W_regularizer": null, "border_mode": "valid", "W_constraint": null, "activation": "relu"}, "inbound_nodes": [[["maxpooling2d_4", 0, 0]]]}, {"name": "convolution2d_13", "class_name": "Convolution2D", "config": {"activity_regularizer": null, "name": "convolution2d_13", "bias": true, "trainable": true, "nb_col": 1, "subsample": [1, 1], "nb_row": 1, "b_regularizer": null, "dim_ordering": "th", "b_constraint": null, "nb_filter": 21, "init": "glorot_uniform", "W_regularizer": null, "border_mode": "valid", "W_constraint": null, "activation": "relu"}, "inbound_nodes": [[["maxpooling2d_5", 0, 0]]]}, {"name": "deconvolution2d_1", "class_name": "Deconvolution2D", "config": {"activity_regularizer": null, "b_constraint": null, "trainable": true, "nb_col": 4, "subsample": [2, 2], "nb_row": 4, "b_regularizer": null, "dim_ordering": "th", "output_shape": [null, 21, 30, 30], "name": "deconvolution2d_1", "nb_filter": 21, "init": "glorot_uniform", "W_regularizer": null, "activation": "linear", "border_mode": "valid", "W_constraint": null, "bias": true}, "inbound_nodes": [[["convolution2d_10", 0, 0]]]}, {"name": "deconvolution2d_2", "class_name": "Deconvolution2D", "config": {"activity_regularizer": null, "b_constraint": null, "trainable": true, "nb_col": 8, "subsample": [4, 4], "nb_row": 8, "b_regularizer": null, "dim_ordering": "th", "output_shape": [null, 21, 32, 32], "name": "deconvolution2d_2", "nb_filter": 21, "init": "glorot_uniform", "W_regularizer": null, "activation": "linear", "border_mode": "valid", "W_constraint": null, "bias": true}, "inbound_nodes": [[["convolution2d_13", 0, 0]]]}, {"name": "convolution2d_7", "class_name": "Convolution2D", "config": {"activity_regularizer": null, "name": "convolution2d_7", "bias": true, "trainable": true, "nb_col": 1, "subsample": [1, 1], "nb_row": 1, "b_regularizer": null, "dim_ordering": "th", "b_constraint": null, "nb_filter": 21, "init": "glorot_uniform", "W_regularizer": null, "border_mode": "valid", "W_constraint": null, "activation": "relu"}, "inbound_nodes": [[["maxpooling2d_3", 0, 0]]]}, {"name": "cropping2d_1", "class_name": "Cropping2D", "config": {"name": "cropping2d_1", "cropping": [[1, 1], [1, 1]], "trainable": true}, "inbound_nodes": [[["deconvolution2d_1", 0, 0]]]}, {"name": "cropping2d_2", "class_name": "Cropping2D", "config": {"name": "cropping2d_2", "cropping": [[2, 2], [2, 2]], "trainable": true}, "inbound_nodes": [[["deconvolution2d_2", 0, 0]]]}, {"name": "merge_1", "class_name": "Merge", "config": {"name": "merge_1", "mode_type": "raw", "output_shape_type": "raw", "mode": "sum", "concat_axis": -1, "output_shape": null, "dot_axes": -1}, "inbound_nodes": [[["convolution2d_7", 0, 0], ["cropping2d_1", 0, 0], ["cropping2d_2", 0, 0]]]}, {"name": "deconvolution2d_3", "class_name": "Deconvolution2D", "config": {"activity_regularizer": null, "b_constraint": null, "trainable": true, "nb_col": 16, "subsample": [8, 8], "nb_row": 16, "b_regularizer": null, "dim_ordering": "th", "output_shape": [null, 21, 232, 232], "name": "deconvolution2d_3", "nb_filter": 21, "init": "glorot_uniform", "W_regularizer": null, "activation": "linear", "border_mode": "valid", "W_constraint": null, "bias": true}, "inbound_nodes": [[["merge_1", 0, 0]]]}, {"name": "cropping2d_3", "class_name": "Cropping2D", "config": {"name": "cropping2d_3", "cropping": [[4, 4], [4, 4]], "trainable": true}, "inbound_nodes": [[["deconvolution2d_3", 0, 0]]]}, {"name": "reshape_1", "class_name": "Reshape", "config": {"name": "reshape_1", "trainable": true, "target_shape": [21, 50176]}, "inbound_nodes": [[["cropping2d_3", 0, 0]]]}, {"name": "permute_1", "class_name": "Permute", "config": {"name": "permute_1", "dims": [2, 1], "trainable": true}, "inbound_nodes": [[["reshape_1", 0, 0]]]}, {"name": "activation_1", "class_name": "Activation", "config": {"name": "activation_1", "activation": "softmax", "trainable": true}, "inbound_nodes": [[["permute_1", 0, 0]]]}], "output_layers": [["activation_1", 0, 0]], "input_layers": [["input_1", 0, 0]]}, "keras_version": "1.1.0"}