{"class_name": "Model", "config": {"name": "model_1", "input_layers": [["input_1", 0, 0]], "layers": [{"class_name": "InputLayer", "name": "input_1", "config": {"name": "input_1", "batch_input_shape": [null, 3, 224, 224], "input_dtype": "float32"}, "inbound_nodes": []}, {"class_name": "ZeroPadding2D", "name": "zeropadding2d_1", "config": {"trainable": true, "padding": [1, 1], "name": "zeropadding2d_1"}, "inbound_nodes": [[["input_1", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_1", "config": {"b_regularizer": null, "name": "convolution2d_1", "subsample": [1, 1], "dim_ordering": "th", "border_mode": "valid", "W_regularizer": null, "activation": "relu", "init": "glorot_uniform", "trainable": true, "activity_regularizer": null, "nb_col": 3, "W_constraint": null, "nb_filter": 64, "nb_row": 3, "b_constraint": null}, "inbound_nodes": [[["zeropadding2d_1", 0, 0]]]}, {"class_name": "ZeroPadding2D", "name": "zeropadding2d_2", "config": {"trainable": true, "padding": [1, 1], "name": "zeropadding2d_2"}, "inbound_nodes": [[["convolution2d_1", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_2", "config": {"b_regularizer": null, "name": "convolution2d_2", "subsample": [1, 1], "dim_ordering": "th", "border_mode": "valid", "W_regularizer": null, "activation": "relu", "init": "glorot_uniform", "trainable": true, "activity_regularizer": null, "nb_col": 3, "W_constraint": null, "nb_filter": 64, "nb_row": 3, "b_constraint": null}, "inbound_nodes": [[["zeropadding2d_2", 0, 0]]]}, {"class_name": "MaxPooling2D", "name": "maxpooling2d_1", "config": {"trainable": true, "name": "maxpooling2d_1", "dim_ordering": "th", "border_mode": "valid", "pool_size": [2, 2], "strides": [2, 2]}, "inbound_nodes": [[["convolution2d_2", 0, 0]]]}, {"class_name": "ZeroPadding2D", "name": "zeropadding2d_3", "config": {"trainable": true, "padding": [1, 1], "name": "zeropadding2d_3"}, "inbound_nodes": [[["maxpooling2d_1", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_3", "config": {"b_regularizer": null, "name": "convolution2d_3", "subsample": [1, 1], "dim_ordering": "th", "border_mode": "valid", "W_regularizer": null, "activation": "relu", "init": "glorot_uniform", "trainable": true, "activity_regularizer": null, "nb_col": 3, "W_constraint": null, "nb_filter": 128, "nb_row": 3, "b_constraint": null}, "inbound_nodes": [[["zeropadding2d_3", 0, 0]]]}, {"class_name": "ZeroPadding2D", "name": "zeropadding2d_4", "config": {"trainable": true, "padding": [1, 1], "name": "zeropadding2d_4"}, "inbound_nodes": [[["convolution2d_3", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_4", "config": {"b_regularizer": null, "name": "convolution2d_4", "subsample": [1, 1], "dim_ordering": "th", "border_mode": "valid", "W_regularizer": null, "activation": "relu", "init": "glorot_uniform", "trainable": true, "activity_regularizer": null, "nb_col": 3, "W_constraint": null, "nb_filter": 128, "nb_row": 3, "b_constraint": null}, "inbound_nodes": [[["zeropadding2d_4", 0, 0]]]}, {"class_name": "MaxPooling2D", "name": "maxpooling2d_2", "config": {"trainable": true, "name": "maxpooling2d_2", "dim_ordering": "th", "border_mode": "valid", "pool_size": [2, 2], "strides": [2, 2]}, "inbound_nodes": [[["convolution2d_4", 0, 0]]]}, {"class_name": "ZeroPadding2D", "name": "zeropadding2d_5", "config": {"trainable": true, "padding": [1, 1], "name": "zeropadding2d_5"}, "inbound_nodes": [[["maxpooling2d_2", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_5", "config": {"b_regularizer": null, "name": "convolution2d_5", "subsample": [1, 1], "dim_ordering": "th", "border_mode": "valid", "W_regularizer": null, "activation": "relu", "init": "glorot_uniform", "trainable": true, "activity_regularizer": null, "nb_col": 3, "W_constraint": null, "nb_filter": 256, "nb_row": 3, "b_constraint": null}, "inbound_nodes": [[["zeropadding2d_5", 0, 0]]]}, {"class_name": "ZeroPadding2D", "name": "zeropadding2d_6", "config": {"trainable": true, "padding": [1, 1], "name": "zeropadding2d_6"}, "inbound_nodes": [[["convolution2d_5", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_6", "config": {"b_regularizer": null, "name": "convolution2d_6", "subsample": [1, 1], "dim_ordering": "th", "border_mode": "valid", "W_regularizer": null, "activation": "relu", "init": "glorot_uniform", "trainable": true, "activity_regularizer": null, "nb_col": 3, "W_constraint": null, "nb_filter": 256, "nb_row": 3, "b_constraint": null}, "inbound_nodes": [[["zeropadding2d_6", 0, 0]]]}, {"class_name": "MaxPooling2D", "name": "maxpooling2d_3", "config": {"trainable": true, "name": "maxpooling2d_3", "dim_ordering": "th", "border_mode": "valid", "pool_size": [2, 2], "strides": [2, 2]}, "inbound_nodes": [[["convolution2d_6", 0, 0]]]}, {"class_name": "ZeroPadding2D", "name": "zeropadding2d_7", "config": {"trainable": true, "padding": [1, 1], "name": "zeropadding2d_7"}, "inbound_nodes": [[["maxpooling2d_3", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_8", "config": {"b_regularizer": null, "name": "convolution2d_8", "subsample": [1, 1], "dim_ordering": "th", "border_mode": "valid", "W_regularizer": null, "activation": "relu", "init": "glorot_uniform", "trainable": true, "activity_regularizer": null, "nb_col": 3, "W_constraint": null, "nb_filter": 512, "nb_row": 3, "b_constraint": null}, "inbound_nodes": [[["zeropadding2d_7", 0, 0]]]}, {"class_name": "ZeroPadding2D", "name": "zeropadding2d_8", "config": {"trainable": true, "padding": [1, 1], "name": "zeropadding2d_8"}, "inbound_nodes": [[["convolution2d_8", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_9", "config": {"b_regularizer": null, "name": "convolution2d_9", "subsample": [1, 1], "dim_ordering": "th", "border_mode": "valid", "W_regularizer": null, "activation": "relu", "init": "glorot_uniform", "trainable": true, "activity_regularizer": null, "nb_col": 3, "W_constraint": null, "nb_filter": 512, "nb_row": 3, "b_constraint": null}, "inbound_nodes": [[["zeropadding2d_8", 0, 0]]]}, {"class_name": "MaxPooling2D", "name": "maxpooling2d_4", "config": {"trainable": true, "name": "maxpooling2d_4", "dim_ordering": "th", "border_mode": "valid", "pool_size": [2, 2], "strides": [2, 2]}, "inbound_nodes": [[["convolution2d_9", 0, 0]]]}, {"class_name": "ZeroPadding2D", "name": "zeropadding2d_9", "config": {"trainable": true, "padding": [1, 1], "name": "zeropadding2d_9"}, "inbound_nodes": [[["maxpooling2d_4", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_11", "config": {"b_regularizer": null, "name": "convolution2d_11", "subsample": [1, 1], "dim_ordering": "th", "border_mode": "valid", "W_regularizer": null, "activation": "relu", "init": "glorot_uniform", "trainable": true, "activity_regularizer": null, "nb_col": 3, "W_constraint": null, "nb_filter": 512, "nb_row": 3, "b_constraint": null}, "inbound_nodes": [[["zeropadding2d_9", 0, 0]]]}, {"class_name": "ZeroPadding2D", "name": "zeropadding2d_10", "config": {"trainable": true, "padding": [1, 1], "name": "zeropadding2d_10"}, "inbound_nodes": [[["convolution2d_11", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_12", "config": {"b_regularizer": null, "name": "convolution2d_12", "subsample": [1, 1], "dim_ordering": "th", "border_mode": "valid", "W_regularizer": null, "activation": "relu", "init": "glorot_uniform", "trainable": true, "activity_regularizer": null, "nb_col": 3, "W_constraint": null, "nb_filter": 512, "nb_row": 3, "b_constraint": null}, "inbound_nodes": [[["zeropadding2d_10", 0, 0]]]}, {"class_name": "MaxPooling2D", "name": "maxpooling2d_5", "config": {"trainable": true, "name": "maxpooling2d_5", "dim_ordering": "th", "border_mode": "valid", "pool_size": [2, 2], "strides": [2, 2]}, "inbound_nodes": [[["convolution2d_12", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_10", "config": {"b_regularizer": null, "name": "convolution2d_10", "subsample": [1, 1], "dim_ordering": "th", "border_mode": "valid", "W_regularizer": null, "activation": "linear", "init": "glorot_uniform", "trainable": true, "activity_regularizer": null, "nb_col": 1, "W_constraint": null, "nb_filter": 21, "nb_row": 1, "b_constraint": null}, "inbound_nodes": [[["maxpooling2d_4", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_13", "config": {"b_regularizer": null, "name": "convolution2d_13", "subsample": [1, 1], "dim_ordering": "th", "border_mode": "valid", "W_regularizer": null, "activation": "relu", "init": "glorot_uniform", "trainable": true, "activity_regularizer": null, "nb_col": 1, "W_constraint": null, "nb_filter": 21, "nb_row": 1, "b_constraint": null}, "inbound_nodes": [[["maxpooling2d_5", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_7", "config": {"b_regularizer": null, "name": "convolution2d_7", "subsample": [1, 1], "dim_ordering": "th", "border_mode": "valid", "W_regularizer": null, "activation": "linear", "init": "glorot_uniform", "trainable": true, "activity_regularizer": null, "nb_col": 1, "W_constraint": null, "nb_filter": 21, "nb_row": 1, "b_constraint": null}, "inbound_nodes": [[["maxpooling2d_3", 0, 0]]]}, {"class_name": "UpSampling2D", "name": "upsampling2d_1", "config": {"trainable": true, "name": "upsampling2d_1", "size": [2, 2]}, "inbound_nodes": [[["convolution2d_10", 0, 0]]]}, {"class_name": "UpSampling2D", "name": "upsampling2d_2", "config": {"trainable": true, "name": "upsampling2d_2", "size": [4, 4]}, "inbound_nodes": [[["convolution2d_13", 0, 0]]]}, {"class_name": "Merge", "name": "merge_1", "config": {"dot_axes": [-1, -1], "name": "merge_1", "mode": "concat", "mode_type": "raw", "output_shape_type": "raw", "concat_axis": 0, "output_shape": null}, "inbound_nodes": [[["convolution2d_7", 0, 0], ["upsampling2d_1", 0, 0], ["upsampling2d_2", 0, 0]]]}, {"class_name": "UpSampling2D", "name": "upsampling2d_3", "config": {"trainable": true, "name": "upsampling2d_3", "size": [8, 8]}, "inbound_nodes": [[["merge_1", 0, 0]]]}, {"class_name": "Reshape", "name": "reshape_1", "config": {"trainable": true, "target_shape": [21, 50176], "name": "reshape_1"}, "inbound_nodes": [[["upsampling2d_3", 0, 0]]]}, {"class_name": "Permute", "name": "permute_1", "config": {"trainable": true, "name": "permute_1", "dims": [2, 1]}, "inbound_nodes": [[["reshape_1", 0, 0]]]}, {"class_name": "Activation", "name": "activation_1", "config": {"trainable": true, "name": "activation_1", "activation": "softmax"}, "inbound_nodes": [[["permute_1", 0, 0]]]}], "output_layers": [["activation_1", 0, 0]]}}